app/controllers/tweets_controller.rb

  def create
      # render plain: params[:tweet].inspect
      @tweet = Tweet.new(tweet_params)
      hashtag = @tweet.hashtag
      tweet_content = TwitterApiController.new.fetch_tweets(hashtag)

      tweet_content.each do |t|
        if t != tweet_content.last
          @next_tweet = Tweet.new
          @next_tweet.hashtag = hashtag
          @next_tweet.tweet_text = t.text
          @next_tweet.save
---
INSERT INTO `tweets` (`hashtag`, `tweet_text`, `created_at`, `updated_at`) VALUES ('federer', 'RT @dannymiche: #Paris R3\nDjokovic/Simon\nBerdych/Tsonga\nWawrinka/Troicki\nNadal/Anderson\nFerrer/Dimitrov\nFederer/Isner\nNishikori /Gasquet\nMu…', '2015-11-05 00:11:31', '2015-11-05 00:11:31')